espruino/Espruino/targets/stm32/jshardware.c
TIM_TypeDef* getTimerFromPinFunction(JshPinFunction device) {
  switch (device&JSH_MASK_TYPE) {
    case JSH_TIMER1:
      return TIM1;
    case JSH_TIMER2:
      return TIM2;
    case JSH_TIMER3:
      return TIM3;
    case JSH_TIMER4:
      return TIM4;
#ifndef STM32F3
    case JSH_TIMER5:
      return TIM5;
#endif
/*        case JSH_TIMER6: // Not used for outputs
      return TIM6;
    case JSH_TIMER7: // Not used for outputs
      return TIM7; */
    case JSH_TIMER8:
      return TIM8;
#ifndef STM32F3
    case JSH_TIMER9:
      return TIM9;
    case JSH_TIMER10:
      return TIM10;
    case JSH_TIMER11:
      return TIM11;
    case JSH_TIMER12:
      return TIM12;
    case JSH_TIMER13:
      return TIM13;
    case JSH_TIMER14:
      return TIM14;
#else
    case JSH_TIMER15:
      return TIM15;
    case JSH_TIMER16:
      return TIM16;
    case JSH_TIMER17:
      return TIM17;
#endif

  }
  return 0;
}

USART_TypeDef* getUsartFromDevice(IOEventFlags device) {
 switch (device) {
   case EV_SERIAL1 : return USART1;
   case EV_SERIAL2 : return USART2;
   case EV_SERIAL3 : return USART3;
#if USARTS>=4
   case EV_SERIAL4 : return UART4;
#endif
#if USARTS>=5
   case EV_SERIAL5 : return UART5;
#endif
#if USARTS>=6
   case EV_SERIAL6 : return USART6;
#endif
   default: return 0;
 }
}

SPI_TypeDef* getSPIFromDevice(IOEventFlags device) {
 switch (device) {
   case EV_SPI1 : return SPI1;
   case EV_SPI2 : return SPI2;
   case EV_SPI3 : return SPI3;
   default: return 0;
 }
}

I2C_TypeDef* getI2CFromDevice(IOEventFlags device) {
 switch (device) {
   case EV_I2C1 : return I2C1;
   case EV_I2C2 : return I2C2;
#if I2CS>=3
   case EV_I2C3 : return I2C3;
#endif
   default: return 0;
 }
}

JshPinFunction getPinFunctionFromDevice(IOEventFlags device) {
 switch (device) {
   case EV_SERIAL1 : return JSH_USART1;
   case EV_SERIAL2 : return JSH_USART2;
   case EV_SERIAL3 : return JSH_USART3;
   case EV_SERIAL4 : return JSH_USART4;
   case EV_SERIAL5 : return JSH_USART5;
   case EV_SERIAL6 : return JSH_USART6;

   case EV_SPI1    : return JSH_SPI1;
   case EV_SPI2    : return JSH_SPI2;
   case EV_SPI3    : return JSH_SPI3;

   case EV_I2C1    : return JSH_I2C1;
   case EV_I2C2    : return JSH_I2C2;
   case EV_I2C3    : return JSH_I2C3;
   default: return 0;
 }
}

unsigned int jshGetTimerFreq(TIM_TypeDef *TIMx) {
  // TIM2-7, 12-14  on APB1, everything else is on APB2
  RCC_ClocksTypeDef clocks;
  RCC_GetClocksFreq(&clocks);

  // This (oddly) looks the same on F1/2/3/4. It's probably not
  bool APB1 = TIMx==TIM2 || TIMx==TIM3 || TIMx==TIM4 ||
#ifndef STM32F3
              TIMx==TIM5 ||
#endif
              TIMx==TIM6 || TIMx==TIM7 ||
#ifndef STM32F3
              TIMx==TIM12 || TIMx==TIM13 || TIMx==TIM14 ||
#endif
              false;

  unsigned int freq = APB1 ? clocks.PCLK1_Frequency : clocks.PCLK2_Frequency;
  // If APB1 clock divisor is 1x, this is only 1x
  if (clocks.HCLK_Frequency == freq)
    return freq;
  // else it's 2x (???)
  return freq*2;
}

static unsigned int jshGetSPIFreq(SPI_TypeDef *SPIx) {
  RCC_ClocksTypeDef clocks;
  RCC_GetClocksFreq(&clocks);
  bool APB2 = SPIx == SPI1;
  return APB2 ? clocks.PCLK2_Frequency : clocks.PCLK1_Frequency;
}

// Prints a list of capable pins, eg:
// jshPrintCapablePins(..., "PWM", JSH_TIMER1, JSH_TIMERMAX, 0,0, false)
// jshPrintCapablePins(..., "SPI", JSH_SPI1, JSH_SPIMAX, JSH_MASK_INFO,JSH_SPI_SCK, false)
// jshPrintCapablePins(..., "Analog Input", 0,0,0,0, true) - for analogs
static void NO_INLINE jshPrintCapablePins(Pin existingPin, const char *functionName, JshPinFunction typeMin, JshPinFunction typeMax, JshPinFunction pMask, JshPinFunction pData, bool printAnalogs) {
  if (functionName) {
    jsError("Pin %p is not capable of %s\nSuitable pins are:", existingPin, functionName);
  }

  Pin pin;
  int i,n=0;
  for (pin=0;pin<JSH_PIN_COUNT;pin++) {
    bool has = false;
#ifdef STM32F1
    int af = 0;
#endif
    if (printAnalogs) {
      has = pinInfo[pin].analog!=JSH_ANALOG_NONE;
    } else {
      for (i=0;i<JSH_PININFO_FUNCTIONS;i++) {
        JshPinFunction type = pinInfo[pin].functions[i] & JSH_MASK_TYPE;
        if (type>=typeMin && type<=typeMax && ((pinInfo[pin].functions[i]&pMask)==pData)) {
          has = true;
#ifdef STM32F1
          af = pinInfo[pin].functions[i] & JSH_MASK_AF;
#endif
        }
      }
    }
    if (has) {
      jsiConsolePrintf("%p",pin);
#ifdef STM32F1
      if (af!=JSH_AF0) jsiConsolePrint("(AF)");
#endif
      jsiConsolePrint(" ");
      if (n++==8) { n=0; jsiConsolePrint("\n"); }
    }
  }
  jsiConsolePrint("\n");
}

// ----------------------------------------------------------------------------
#ifdef USE_RTC
volatile unsigned int ticksSinceStart = 0;
// Average time between SysTicks
volatile unsigned int averageSysTickTime=0, smoothAverageSysTickTime=0;
// last system time there was a systick
volatile JsSysTime lastSysTickTime=0, smoothLastSysTickTime=0;
// whether we have slept since the last SysTick
bool hasSystemSlept;

#else
volatile JsSysTime SysTickMajor = SYSTICK_RANGE;
#endif

#ifdef USB
unsigned int SysTickUSBWatchdog = 0;
void jshKickUSBWatchdog() {
  SysTickUSBWatchdog = 0;
}
#endif //USB

static bool jshIsRTCAlreadySetup(bool andRunning) {
  if ((RCC->BDCR & RCC_BDCR_RTCEN) == 0)
    return false; // RTC was off - return false
  if (!andRunning) return true;
  // Check what we're running the RTC off and make sure that it's running!
  if ((RCC->BDCR & (RCC_RTCCLKSource_LSE|RCC_RTCCLKSource_LSI)) == RCC_RTCCLKSource_LSE)
    return RCC_GetFlagStatus(RCC_FLAG_LSERDY) == SET;
  else
    return RCC_GetFlagStatus(RCC_FLAG_LSIRDY) == SET;
}

#ifdef USE_RTC
void jshSetupRTCPrescaler(bool isUsingLSI) {
  if (isUsingLSI) {
#ifdef STM32F1
    jshRTCPrescaler = 40000; // 40kHz for LSI on F1 parts
#else
    jshRTCPrescaler = 32768; // 32kHz for LSI
#endif
  } else {
    jshRTCPrescaler = 32768; // 32kHz for LSE
  }
  jshRTCPrescalerReciprocal = (unsigned short)((((unsigned int)JSSYSTIME_SECOND) << RTC_PRESCALER_RECIPROCAL_SHIFT) /  jshRTCPrescaler);
}
#endif

void jshDoSysTick() {
  /* Handle the delayed Ctrl-C -> interrupt behaviour (see description by EXEC_CTRL_C's definition)  */
  if (execInfo.execute & EXEC_CTRL_C_WAIT)
    execInfo.execute = (execInfo.execute & ~EXEC_CTRL_C_WAIT) | EXEC_INTERRUPTED;
  if (execInfo.execute & EXEC_CTRL_C)
    execInfo.execute = (execInfo.execute & ~EXEC_CTRL_C) | EXEC_CTRL_C_WAIT;

