espruino/Espruino/targets/stm32/jshardware.c
#ifdef USE_RTC
  if (ticksSinceStart!=0xFFFFFFFF)
    ticksSinceStart++;
  if (ticksSinceStart==RTC_INITIALISE_TICKS) {
    /* If RTC is already enabled, we've come back from a reset...
     * we're going to want to keep everything as it was */
    bool alreadySetup = jshIsRTCAlreadySetup(true);
    /* LSEON, LSEBYP, RTCSEL and RTCEN are in backup domain so may not need
     * changing */
     
    if (!alreadySetup) {
      bool isUsingLSI = RCC_GetFlagStatus(RCC_FLAG_LSERDY)==RESET;
      
      if (RCC->BDCR & (RCC_RTCCLKSource_LSE|RCC_RTCCLKSource_LSI)) {
        // Uh-oh - RTC *was* set up for something, but it's not
        // the case any more. It needs totally resetting so we can change it
        RCC_BackupResetCmd(ENABLE);
        RCC_BackupResetCmd(DISABLE);
	    RCC_LSEConfig(RCC_LSE_ON); // reset would have turned LSE off
      }
      
      if (isUsingLSI) {
        // LSE is not working - turn it off and use LSI
        RCC_RTCCLKConfig(RCC_RTCCLKSource_LSI); // set clock source to low speed internal
        RCC_LSEConfig(RCC_LSE_OFF);  // disable low speed external oscillator
      } else {
        // LSE working! Yay! turn LSI off now
        RCC_LSEConfig(RCC_LSE_ON);
        RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE); // set clock source to low speed external
        RCC_LSICmd(DISABLE); // disable low speed internal oscillator
      }
      jshSetupRTCPrescaler(isUsingLSI);
      RCC_RTCCLKCmd(ENABLE); // enable RTC (in backup domain)
      RTC_WaitForSynchro();
  #ifdef STM32F1
      RTC_SetPrescaler(jshRTCPrescaler - 1U);
      RTC_WaitForLastTask();
  #else
      RTC_InitTypeDef RTC_InitStructure;
      RTC_StructInit(&RTC_InitStructure);
      //RTC_InitStructure.RTC_AsynchPrediv = 0x7F;
      //RTC_InitStructure.RTC_SynchPrediv =  0xFF; /* (32KHz / (RTC_AsynchPrediv+1)) - 1 = 0xFF */
      RTC_InitStructure.RTC_AsynchPrediv = 0;
      RTC_InitStructure.RTC_SynchPrediv =  (uint32_t)(jshRTCPrescaler-1); // TODO: RTC_AsynchPrediv larger for power consumption - but then timestamps are less accurate
      RTC_InitStructure.RTC_HourFormat = RTC_HourFormat_24;
      RTC_Init(&RTC_InitStructure);
  #endif
    } else { // alreadySetup
      // Already set up, so just turn off the relevant oscillator
      if ((RCC->BDCR & (RCC_RTCCLKSource_LSE|RCC_RTCCLKSource_LSI)) == RCC_RTCCLKSource_LSE) {
        RCC_LSICmd(DISABLE);
      } else {
        RCC_LSEConfig(RCC_LSE_OFF);
      }
    }
  }

  JsSysTime time = jshGetRTCSystemTime();
  if (!hasSystemSlept && ticksSinceStart>RTC_INITIALISE_TICKS) {
    /* Ok - slightly crazy stuff here. So the normal jshGetSystemTime is now
     * working off of the SysTick again to get the accuracy. But this means
     * that we can't just change lastSysTickTime to the current time, because
     * there will be an apparent glitch if SysTick happens when measuring the
     * length of a pulse.
     */
    smoothLastSysTickTime = smoothLastSysTickTime + smoothAverageSysTickTime; // we MUST advance this by what we assumed it was going to advance by last time!
    // work out the 'real' average sysTickTime
    JsSysTime diff = time - lastSysTickTime;
    // saturate...
    if (diff < 0) diff = 0;
    if (diff > 0xFFFFFFFF) diff = 0xFFFFFFFF;
    // and work out average without overflow (averageSysTickTime*3+diff)/4
    averageSysTickTime = (averageSysTickTime>>1) +
                         (averageSysTickTime>>2) +
                         ((unsigned int)diff>>2);
    // what do we expect the RTC time to be on the next SysTick?
    JsSysTime nextSysTickTime = time + (JsSysTime)averageSysTickTime;
    // Now the smooth average is the average of what we had, and what we need to get back in line with the actual time
    diff = nextSysTickTime - smoothLastSysTickTime;
    // saturate...
    if (diff < 0) diff = 0;
    if (diff > 0xFFFFFFFF) diff = 0xFFFFFFFF;
    smoothAverageSysTickTime = (smoothAverageSysTickTime>>1) +
                               (smoothAverageSysTickTime>>2) +
                               ((unsigned int)diff>>2);
  } else {
    hasSystemSlept = false;
    smoothLastSysTickTime = time;
    smoothAverageSysTickTime = averageSysTickTime;
    // and don't touch the real average
  }
  lastSysTickTime = time;
#else
  SysTickMajor += SYSTICK_RANGE;
#endif

#ifdef USB
  if (SysTickUSBWatchdog < SYSTICKS_BEFORE_USB_DISCONNECT) {
    SysTickUSBWatchdog++;
  }
#endif //USB
}

// ----------------------------------------------------------------------------

void jshInterruptOff() {
  //  jshPinSetValue(LED4_PININDEX,1);
  __disable_irq();
}

void jshInterruptOn() {
  __enable_irq();
  //  jshPinSetValue(LED4_PININDEX,0);
}


//int JSH_DELAY_OVERHEAD = 0;
int JSH_DELAY_MULTIPLIER = 1;
void jshDelayMicroseconds(int microsec) {
  int iter = (int)(((long long)microsec * (long long)JSH_DELAY_MULTIPLIER) >> 10);
//  iter -= JSH_DELAY_OVERHEAD;
  if (iter<0) iter=0;
  while (iter--) __NOP();
}

ALWAYS_INLINE void jshPinSetState(Pin pin, JshPinState state) {
  GPIO_InitTypeDef GPIO_InitStructure;
  bool out = JSHPINSTATE_IS_OUTPUT(state);
  bool af = state==JSHPINSTATE_AF_OUT ||
            state==JSHPINSTATE_AF_OUT_OPENDRAIN ||
            state==JSHPINSTATE_USART_IN ||
            state==JSHPINSTATE_USART_OUT ||
            state==JSHPINSTATE_I2C;
  bool pullup = state==JSHPINSTATE_GPIO_OUT_OPENDRAIN || state==JSHPINSTATE_GPIO_IN_PULLUP || state==JSHPINSTATE_USART_IN;
  bool pulldown = state==JSHPINSTATE_GPIO_IN_PULLDOWN;
  bool opendrain = JSHPINSTATE_IS_OPENDRAIN(state);

  if (out) {
  #ifdef STM32API2
    if (af) GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    else if (state==JSHPINSTATE_DAC_OUT) GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
    else GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = opendrain ? GPIO_OType_OD : GPIO_OType_PP;
  #else
    if (af) GPIO_InitStructure.GPIO_Mode = opendrain ? GPIO_Mode_AF_OD : GPIO_Mode_AF_PP;
    else GPIO_InitStructure.GPIO_Mode = opendrain ? GPIO_Mode_Out_OD : GPIO_Mode_Out_PP;
  #endif
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  } else {
  #ifdef STM32API2
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    if (af) GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    if (state==JSHPINSTATE_ADC_IN) GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  #else
    GPIO_InitStructure.GPIO_Mode = pulldown ? GPIO_Mode_IPD : (pullup ? GPIO_Mode_IPU : GPIO_Mode_IN_FLOATING);
  #endif
  }
#ifdef STM32API2
  GPIO_InitStructure.GPIO_PuPd = pulldown ? GPIO_PuPd_DOWN : (pullup ? GPIO_PuPd_UP : GPIO_PuPd_NOPULL);
#endif
  GPIO_InitStructure.GPIO_Pin = stmPin(pin);
  GPIO_Init(stmPort(pin), &GPIO_InitStructure);
}

JshPinState jshPinGetState(Pin pin) {
  GPIO_TypeDef* port = stmPort(pin);
  uint16_t pinn = stmPin(pin);
  int pinNumber = pinInfo[pin].pin;
  bool isOn = (port->ODR&pinn) != 0;
#ifdef STM32F1
  unsigned int crBits = ((pinNumber < 8) ? (port->CRL>>(pinNumber*4)) : (port->CRH>>((pinNumber-8)*4))) & 15;
  unsigned int mode = crBits &3;
  unsigned int cnf = (crBits>>2)&3;
  if (mode==0) { // input
    if (cnf==0) return JSHPINSTATE_ADC_IN;
    else if (cnf==1) return JSHPINSTATE_GPIO_IN;
    else /* cnf==2, 3=reserved */
      return isOn ? JSHPINSTATE_GPIO_IN_PULLUP : JSHPINSTATE_GPIO_IN_PULLDOWN;
  } else { // output
    if (cnf&2) // af
      return (cnf&1) ? JSHPINSTATE_AF_OUT_OPENDRAIN : JSHPINSTATE_AF_OUT;
    else { // normal
      return ((cnf&1) ? JSHPINSTATE_GPIO_OUT_OPENDRAIN : JSHPINSTATE_GPIO_OUT) |
             (isOn ? JSHPINSTATE_PIN_IS_ON : 0);
    }
  }
#else
  int mode = (port->MODER >> (pinNumber*2)) & 3;
  if (mode==0) { // input
    int pupd = (port->PUPDR >> (pinNumber*2)) & 3;
    if (pupd==1) return JSHPINSTATE_GPIO_IN_PULLUP;
    if (pupd==2) return JSHPINSTATE_GPIO_IN_PULLDOWN;
    return JSHPINSTATE_GPIO_IN;
  } else if (mode==1) { // output
    return ((port->OTYPER&pinn) ? JSHPINSTATE_GPIO_OUT_OPENDRAIN : JSHPINSTATE_GPIO_OUT) |
            (isOn ? JSHPINSTATE_PIN_IS_ON : 0);
  } else if (mode==2) { // AF
    return (port->OTYPER&pinn) ? JSHPINSTATE_AF_OUT_OPENDRAIN : JSHPINSTATE_AF_OUT;
  } else { // 3, analog
    return JSHPINSTATE_ADC_IN;
  }
#endif
  // GPIO_ReadOutputDataBit(port, pinn);
}

static NO_INLINE void jshPinSetFunction(Pin pin, JshPinFunction func) {
  if (JSH_PINFUNCTION_IS_USART(func)) {
    if ((func&JSH_MASK_INFO)==JSH_USART_RX)
      jshPinSetState(pin, JSHPINSTATE_USART_IN);
    else
      jshPinSetState(pin,JSHPINSTATE_USART_OUT);
  } else if (JSH_PINFUNCTION_IS_I2C(func)) {
    jshPinSetState(pin, JSHPINSTATE_I2C);
#ifdef STM32F1  // F4 needs SPI MOSI to be set as AF out
  } else if (JSH_PINFUNCTION_IS_SPI(func) && ((func&JSH_MASK_INFO)==JSH_SPI_MISO)) {
    jshPinSetState(pin, JSHPINSTATE_GPIO_IN_PULLUP); // input pullup for MISO
#endif
  } else {
    bool opendrain = JSHPINSTATE_IS_OPENDRAIN(jshPinGetState(pin)&JSHPINSTATE_MASK);
    jshPinSetState(pin, opendrain ? JSHPINSTATE_AF_OUT_OPENDRAIN : JSHPINSTATE_AF_OUT); // otherwise general AF out!
  }
  // now 'connect' the pin up
#if defined(STM32F2) || defined(STM32F3) || defined(STM32F4)
  GPIO_PinAFConfig(stmPort(pin), stmPinSource(pin), functionToAF(func));
#else
  bool remap = (func&JSH_MASK_AF)!=JSH_AF0;
  if ((func&JSH_MASK_TYPE)==JSH_TIMER1)       GPIO_PinRemapConfig( GPIO_FullRemap_TIM1, remap );
  else if ((func&JSH_MASK_TYPE)==JSH_TIMER2)  GPIO_PinRemapConfig( GPIO_FullRemap_TIM2, remap );
  else if ((func&JSH_MASK_TYPE)==JSH_TIMER3) {
    if (pin == JSH_PORTB_OFFSET+4 || pin == JSH_PORTB_OFFSET+5)
      GPIO_PinRemapConfig( GPIO_PartialRemap_TIM3, remap );
    else
      GPIO_PinRemapConfig( GPIO_FullRemap_TIM3, remap );
  } else if ((func&JSH_MASK_TYPE)==JSH_TIMER4)  GPIO_PinRemapConfig( GPIO_Remap_TIM4, remap );
  else if ((func&JSH_MASK_TYPE)==JSH_TIMER15) GPIO_PinRemapConfig( GPIO_Remap_TIM15, remap );
  else if ((func&JSH_MASK_TYPE)==JSH_I2C1) GPIO_PinRemapConfig( GPIO_Remap_I2C1, remap );
  else if ((func&JSH_MASK_TYPE)==JSH_SPI1) GPIO_PinRemapConfig( GPIO_Remap_SPI1, remap );
  else if ((func&JSH_MASK_TYPE)==JSH_SPI3) GPIO_PinRemapConfig( GPIO_Remap_SPI3, remap );
  else if ((func&JSH_MASK_TYPE)==JSH_USART1) GPIO_PinRemapConfig( GPIO_Remap_USART1, remap );
  else if ((func&JSH_MASK_TYPE)==JSH_USART2) GPIO_PinRemapConfig( GPIO_Remap_USART2, remap );
  else if ((func&JSH_MASK_TYPE)==JSH_USART3) GPIO_PinRemapConfig( GPIO_FullRemap_USART3, remap );
  else if (remap) jsError("(internal) Remap needed, but unknown device.");

#endif
}

